// //二维数组
// //类型 数组名 [常量表达式][常量表达式]
// //数组名 [常量表达式][常量表达式] 访问 一个大括号表示一行 行可以不写列不行
// #include <stdio.h>
// int main(){
// //矩阵的转置i j调换就可以
//     int a[4][5]={
//         {1,2,3,4,5},
//         {6,7,8,9,10},
//         {11,12,13,14,15},
//         {16,17,18,19,20}

//     };
//     for (int i = 0; i < 4; i++)
//     {
//         /* code */
//         for (int j = 0; j < 5; j++)
//         {
//             printf("%d ",a[i][j]);
//             /* code */
//         }
//         printf("\n");
        
//     }
//     for (int i = 0; i < 5; i++)
//     {
//         /* code */
//         for (int j = 0; j < 4; j++)
//         {
//             printf("%d ",a[j][i]);
//             /* code */
//         }
//         printf("\n");
        
//     }
    
    

//     return 0;
// }